# pandas数据分析
### 数据分析流程
1. 数据收集
2. 数据清洗
    - 缺失值
    - 错误数据
    - 格式混乱
3. 数据分析
    - 统计(平均值，最大值，比例等等)
    - 分组对比
4. 数据可视化
    - 折线图看趋势
    - 柱状图对比
    - 散点图看相关性
-----

### 1. 数据的导入

In [2]:
import pandas as pd

In [5]:
df = pd.read_csv('../data/employees.csv')
df

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0

### 1.2 JSON数据的导入
- 对于复杂格式的`JSON`文件不能直接使用read_json()函数，需要先使用`json`库进行处理,后转成DataFrame格式再进行操作

In [13]:
import json

with open('../data/test.json', 'r') as f:
    data = json.load(f)
print(data['users'])
print(type(data))
df = pd.DataFrame(data['users'])
print(type(df))
df

[{'id': 1, 'name': '张三', 'age': 28, 'email': 'zhangsan@example.com', 'is_active': True, 'join_date': '2022-03-15'}, {'id': 2, 'name': '李四', 'age': 35, 'email': 'lisi@example.com', 'is_active': False, 'join_date': '2021-11-02'}, {'id': 3, 'name': '王五', 'age': 24, 'email': 'wangwu@example.com', 'is_active': True, 'join_date': '2023-01-20'}]
<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

   id name  age                 email  is_active   join_date
0   1   张三   28  zhangsan@example.com       True  2022-03-15
1   2   李四   35      lisi@example.com      False  2021-11-02
2   3   王五   24    wangwu@example.com       True  2023-01-20

### 2. 数据的导出

In [7]:
df = df.tail()
df.to_csv('../data/employees_new.csv')